Hi @fmunozmiranda. Here is the output from 'terraform apply' with the 'roles' parameter removed in the resource block and debug enabled.

```
+ terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.ciscoise_node_deployment.ise31-2-status will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "ciscoise_node_deployment" "ise31-2-status" {
      + hostname = "ise31-2"
      + id       = (known after apply)
      + item     = (known after apply)
      + items    = (known after apply)
    }

  # ciscoise_node_deployment.join-ise31-2 will be created
  + resource "ciscoise_node_deployment" "join-ise31-2" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + allow_cert_import = "false"
          + fqdn              = "ise31-2.ise.domain.com"
          + hostname          = "ise31-2"
          + ip_address        = (known after apply)
          + node_status       = (known after apply)
          + password          = (sensitive value)
          + roles             = (known after apply)
          + services          = [
              + "Services",
              + "Profiler",
              + "DeviceAdmin",
            ]
          + user_name         = "admin"
        }
    }

  # time_sleep.wait-15-minutes will be created
  + resource "time_sleep" "wait-15-minutes" {
      + create_duration = "15m"
      + id              = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ciscoise_node_deployment_example = (known after apply)
ciscoise_node_deployment.join-ise31-2: Creating...
â•·
â”‚ Error: Failure when executing RegisterNode
â”‚ 
â”‚   with ciscoise_node_deployment.join-ise31-2,
â”‚   on main.tf line 23, in resource "ciscoise_node_deployment" "join-ise31-2":
â”‚   23: resource "ciscoise_node_deployment" "join-ise31-2" {
â”‚ 
â”‚ error with operation RegisterNode
â”‚ {
â”‚   "message" : "request has bad input format in the body",
â”‚   "code" : 400
â”‚ }
â•µ
```